In [57]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
import matplotlib as plt

In [58]:
player_data = "Resources/player_data.csv"
player_data_df = pd.read_csv(player_data)
player_data_df.head()

,name,year_start,year_end,position,height,weight,birth_date,college
0,Alaa Abdelnaby,1991,1995,F-C,6-10,240.0,"June 24, 1968",Duke University
1,Zaid Abdul-Aziz,1969,1978,C-F,6-9,235.0,"April 7, 1946",Iowa State University
2,Kareem Abdul-Jabbar,1970,1989,C,7-2,225.0,"April 16, 1947","University of California, Los Angeles"
3,Mahmoud Abdul-Rauf,1991,2001,G,6-1,162.0,"March 9, 1969",Louisiana State University
4,Tariq Abdul-Wahad,1998,2003,F,6-6,223.0,"November 3, 1974",San Jose State University

In [59]:
player_data_cols = ["name", "year_start", "year_end", "position","height", "weight","birth_date", "college", ]
playerdt_transformed= player_data_df[player_data_cols].copy()

# Rename the column headers
playerdt_transformed = playerdt_transformed.rename(columns={"name": "Player",
                                                          "year_start": "Start_Year",
                                                          "year_end": "End_Year",
                                                           "position": "Position",
                                                            "height": "Height",
                                                            "weight" : "Weight",
                                                           "birth_date" : "Birthday",
                                                           "college" : "University"})

# Clean the data by dropping duplicates and setting the index
#playerdt_transformed.drop_duplicates("id", inplace=True)
#playerdt_transformed.set_index("id", inplace=True)

#playerdt_transformed.index+=1
#playerdt_transformed.index
playerdt_transformed
playerdt_transformed['Height'] = playerdt_transformed['Height'].replace('-', '.', regex=True).astype(float)
playerdt_transformed.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4550 entries, 0 to 4549
Data columns (total 8 columns):
Player        4550 non-null object
Start_Year    4550 non-null int64
End_Year      4550 non-null int64
Position      4549 non-null object
Height        4549 non-null float64
Weight        4544 non-null float64
Birthday      4519 non-null object
University    4248 non-null object
dtypes: float64(2), int64(2), object(4)
memory usage: 284.5+ KB

In [60]:
playerdt_transformed.duplicated().sum()

0

In [61]:
playerdt_transformed.to_csv('players.csv')

In [67]:
#create the connection to the db
rds_connection_string = "postgres:postgres@localhost:5432/NBA_db"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [68]:
engine.table_names()

['player']

In [69]:
playerdt_transformed.to_sql(name='player', con=engine, if_exists='append', index=False)

In [70]:
pd.read_sql_query('select * from player', con=engine).head()

,id,Player,Start_Year,End_Year,Position,Height,Weight,Birthday,University
0,1,Alaa Abdelnaby,1991,1995,F-C,6.0,240.0,1968-06-24,Duke University
1,2,Zaid Abdul-Aziz,1969,1978,C-F,7.0,235.0,1946-04-07,Iowa State University
2,3,Kareem Abdul-Jabbar,1970,1989,C,7.0,225.0,1947-04-16,"University of California, Los Angeles"
3,4,Mahmoud Abdul-Rauf,1991,2001,G,6.0,162.0,1969-03-09,Louisiana State University
4,5,Tariq Abdul-Wahad,1998,2003,F,7.0,223.0,1974-11-03,San Jose State University

In [71]:
pd.read_sql_query('select Player from player', con=engine).head()

                                              player
0  (1,"Alaa Abdelnaby",1991,1995,F-C,6,240,1968-0...
1  (2,"Zaid Abdul-Aziz",1969,1978,C-F,7,235,1946-...
2  (3,"Kareem Abdul-Jabbar",1970,1989,C,7,225,194...
3  (4,"Mahmoud Abdul-Rauf",1991,2001,G,6,162,1969...
4  (5,"Tariq Abdul-Wahad",1998,2003,F,7,223,1974-...